[
    {
        "term": "Central Nervous System (CNS)",
        "definition": "Composed of the brain and spinal cord, it processes and integrates sensory data and coordinates motor output."
    },
    {
        "term": "Cerebrospinal Fluid (CSF)",
        "definition": "A fluid that cushions the CNS, circulates nutrients, and removes waste. Produced by choroid plexuses in the ventricles."
    },
    {
        "term": "Dura Mater",
        "definition": "The tough, outermost meningeal layer that provides structural support and protection for the brain and spinal cord."
    },
    {
        "term": "Arachnoid Mater",
        "definition": "The middle meningeal layer, web-like in structure, containing the subarachnoid space where CSF circulates."
    },
    {
        "term": "Pia Mater",
        "definition": "The delicate innermost layer of the meninges, closely adhering to the surface of the brain and spinal cord, containing blood vessels."
    },
    {
        "term": "Falx Cerebri",
        "definition": "A fold of dura mater that separates the cerebral hemispheres."
    },
    {
        "term": "Choroid Plexuses",
        "definition": "Capillary networks in ventricles that produce cerebrospinal fluid by filtering blood plasma."
    },
    {
        "term": "Fourth Ventricle",
        "definition": "A CSF-filled cavity located between the brainstem and cerebellum, continuous with the central canal of the spinal cord."
    },
    {
        "term": "Components of a Reflex Arc",
        "definition": "Receptor, sensory neuron, interneuron, motor neuron, and effector involved in reflex responses."
    },
    {
        "term": "Flexor Extensor Reflex",
        "definition": "A protective reflex that causes withdrawal from a painful stimulus."
    },
    {
        "term": "Crossed Extensor Reflex",
        "definition": "A reflex where one limb withdraws while the opposite limb extends to maintain balance."
    },
    {
        "term": "Reciprocal Innervation",
        "definition": "The simultaneous activation of one muscle group and inhibition of its antagonist to coordinate movement."
    }

]
